src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
#Область Обработчики_событий_формы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Контрагент", Объект.Ссылка));
	ЗначениеВРеквизитФормы(РегистрыСведений.РеквизитыКонтрагентов.ПолучитьДеревоРеквизитовКонтрагента(Объект.Ссылка), "ДЗРеквизиты");	
	УстановитьДоступностьЛичныйКабинет(); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиент.РазвернутьДеревоЗначений(ДЗРеквизиты, Элементы.ДЗРеквизиты);
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыКонтрагентов.ПередЗаписьюНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"), Отказ);   
	Если СокрЛП(ЭтотОбъект.Имя) <> "" Тогда 
		ТекущийОбъект.Логин = ЭтотОбъект.Имя;
		ТекущийОбъект.Пароль = ЭтотОбъект.Пароль; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РеквизитыКонтрагентов.ПриЗаписиНаСервере(ТекущийОбъект, РеквизитФормыВЗначение("ДЗРеквизиты"));
	ОбновитьПользователя();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма);
	РеквизитыКонтрагентовКлиент.ОбработатьРезультатЗаполненияРеквизитовПоИНН(ЭтаФорма, ЗаполнитьПоИНННаСервере()); 
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКредитаПриИзменении(Элемент)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	РеквизитыКонтрагентовКлиент.СформироватьМенюВыбораВидаРеквизита(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРеквизита(Команда)
	РеквизитыКонтрагентовКлиент.ОткрытьФормуВводаДополнительныхДанных(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВФактическийАдрес(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресФактический"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресДоставки(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресДоставки"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПроживания(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПроживания"));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВАдресПоПрописке(Команда)
	РеквизитыКонтрагентовКлиент.Скопировать(ЭтаФорма, ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.АдресПоПрописке"));
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ВыборТаблицаФормы(ЭтаФорма, ВыбраннаяСтрока, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриАктивизацииСтроки(Элемент)
	РеквизитыКонтрагентовКлиент.ПриАктивацииСтроки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РеквизитыКонтрагентовКлиент.ОбработкаВыбораТаблицаФормы(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПередНачаломИзменения(Элемент, Отказ)
	РеквизитыКонтрагентовКлиент.ПередНачаломИзменения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДоставка Тогда 
		ЗаполнитьСтраницуДоставка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДЗРеквизитыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	//Если Не ОтменаРедактирования Тогда
	//	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
	//		Если Элемент.ТекущиеДанные.Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE") Тогда 
	//			Объект.ICE = СокрЛП(Элемент.ТекущиеДанные.Представление);
	//		КонецЕсли;
	//		Если Элемент.ТекущиеДанные.Реквизит = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN") Тогда 
	//			Объект.CIN = СокрЛП(Элемент.ТекущиеДанные.Представление);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛичныйКабинетПриИзменении(Элемент)
	УстановитьДоступностьЛичныйКабинет();    
	Если Объект.ЛичныйКабинетПартнера Тогда
		Имя = СтрЗаменить(Объект.Наименование, " ", "");   
		Пароль = НовыйПароль();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ЗаполнитьПоИНННаСервере()
	Возврат РеквизитыКонтрагентов.ЗаполнитьРеквизитыПоИННВФорме(ЭтаФорма);
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Элементы.СтраницаДоставка.Видимость = Объект.Покупатель;
	Элементы.СтраницаЛичныйКабинет.Видимость = Объект.Покупатель;
	Элементы.СтраницаКредит.Видимость = Объект.Покупатель;
	Элементы.СуммаКредита.Доступность = Объект.КонтрольКредита;
	Элементы.СрокОплаты.Доступность = Объект.КонтрольКредита;
	Элементы.СпособРасчётаОтсрочки.Доступность = Объект.КонтрольКредита;
КонецПроцедуры

Процедура ЗаполнитьСтраницуДоставка()
	Если Не Объект.ТЧГрафикДоставок.Количество() = 0 тогда Возврат; КонецЕсли;
	Для ДеньНедели = 1 по 7 Цикл 
		Стр = Объект.ТЧГрафикДоставок.Добавить();
		Стр.ДеньНедели = Перечисления.ДниНедели.Получить(ДеньНедели-1);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьРеквизитыОбъектаНаСервере();
	Если РеквизитыКонтрагентовВызовСервера.СуществуетКонтрагентСУказаннымICE(Объект.ICE,Объект.Ссылка) Тогда
		ТекстСообщения = НСтр("fr = 'Contrepartie avec ce ICE existe déjà !'; ru = 'Контрагент с таким идентификационным номеров уже существует!'; en = 'A counterparty with such identification numbers already exists!'; es = 'La contraparte con estos números de identificación ya existe!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыОбъектаНаСервере()
	ДеревоРеквизитов = РеквизитФормыВЗначение("ДЗРеквизиты");
	Мас = ДеревоРеквизитов.Строки.НайтиСтроки(Новый Структура("Реквизит",ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.ICE),Истина);
	Если Мас.Количество() = 0 Тогда 
		Объект.ICE = "";
	Иначе
		Объект.ICE = СокрЛП(Мас.Получить(0).Представление);
	КонецЕсли;
	Мас = ДеревоРеквизитов.Строки.НайтиСтроки(Новый Структура("Реквизит",ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.CIN),Истина);
	Если Мас.Количество() = 0 Тогда 
		Объект.CIN = "";
	Иначе
		Объект.CIN = СокрЛП(Мас.Получить(0).Представление);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЛичныйКабинет()
	Элементы.Имя.Доступность = Объект.ЛичныйКабинетПартнера;
	Элементы.Пароль.Доступность = Объект.Покупатель;
	Элементы.Организация.Доступность = Объект.Покупатель;
КонецПроцедуры	

&НаСервере
Процедура ОбновитьПользователя()
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.Пользователь.ИдентификаторПользователяИБ);
		ПользовательИБ.Имя = Имя;
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.Записать();
		ТекПользователь = Объект.Пользователь.ПолучитьОбъект();
		ТекПользователь.Организация = Организация;
		ТекПользователь.Записать();
	Иначе
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПароль(Команда)
	
	Пароль = НовыйПароль();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйПароль()
	
	ГСП = Новый ГенераторСлучайныхПаролей;	
	НовыйПароль = ГСП.СлучайныйПароль(8);
	
	Возврат НовыйПароль;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЛогин(Команда)
	Имя = СтрЗаменить(Объект.Наименование, " ", "");  
КонецПроцедуры

#КонецОбласти
